In [1]:
import pandas as pd

 # By direct method

In [2]:
obj = pd.Series([1,2,3,4])  #without giving index, it takes index from 0 to so on.

In [3]:
obj

0    1
1    2
2    3
3    4
dtype: int64

In [4]:
obj_with_index = pd.Series([10,20,30,40] , index=['a','b','c','d']) # with give index, we can give any type of index like strings or nums.
# it is necessory to give equal indexes with values of series, if we have 4 series so we have to give 4 indexes

In [5]:
obj_with_index

a    10
b    20
c    30
d    40
dtype: int64

# By Passing Python's List

In [6]:
our_list = [50,60,70,1.2,52.2,'a','b']

In [7]:
obj_bypassing_list = pd.Series(our_list)

In [8]:
obj_bypassing_list

0      50
1      60
2      70
3     1.2
4    52.2
5       a
6       b
dtype: object

In [9]:
index = ['a','b','c','d','e','f','g']

In [10]:
obj_bypassing_list = pd.Series(our_list,index=index) # we pass the index by list.

In [11]:
obj_bypassing_list

a      50
b      60
c      70
d     1.2
e    52.2
f       a
g       b
dtype: object

In [12]:
obj_bypassing_list = pd.Series(our_list,index=index, name='Series Practice') # we can give internal name to series as well.

In [13]:
obj_bypassing_list

a      50
b      60
c      70
d     1.2
e    52.2
f       a
g       b
Name: Series Practice, dtype: object

# By Passing Numpy Array

In [14]:
import numpy as np

In [15]:
array1 = np.array([10,20,30,40,50])

In [16]:
obj_bypassing_array = pd.Series(array1,index = ['a','b','c','d','e'])

In [17]:
obj_bypassing_array

a    10
b    20
c    30
d    40
e    50
dtype: int32

In [18]:
obj_bypassing_array[obj_bypassing_array<30]

a    10
b    20
dtype: int32

# By Passing Dictionary

In [19]:
our_dict = {'name' : 'Salman' , 'Fathers Name' : 'Zakir' , 'Age' : 19}

In [20]:
obj_bypassing_dict = pd.Series(our_dict) #when we pass the dictionary, if we want to give indexes so we have to give indexes that are availabe in dictionary otherwise it will give nan.

In [21]:
obj_bypassing_dict

name            Salman
Fathers Name     Zakir
Age                 19
dtype: object

In [22]:
indexes = ['name','class','Age','Fathers Name']

In [23]:
obj_bypassing_dict = pd.Series(our_dict,index = indexes)

In [24]:
obj_bypassing_dict

name            Salman
class              NaN
Age                 19
Fathers Name     Zakir
dtype: object

In [25]:
obj_bypassing_dict.isnull()

name            False
class            True
Age             False
Fathers Name    False
dtype: bool

In [26]:
pd.isnull(obj_bypassing_dict)

name            False
class            True
Age             False
Fathers Name    False
dtype: bool

In [27]:
obj_bypassing_dict.notnull()

name             True
class           False
Age              True
Fathers Name     True
dtype: bool

In [28]:
pd.notnull(obj_bypassing_dict)

name             True
class           False
Age              True
Fathers Name     True
dtype: bool

In [29]:
obj_bypassing_dict

name            Salman
class              NaN
Age                 19
Fathers Name     Zakir
dtype: object

In [30]:
obj_bypassing_dict.index.name = 'Biodata'

In [31]:
obj_bypassing_dict

Biodata
name            Salman
class              NaN
Age                 19
Fathers Name     Zakir
dtype: object

# DataFrames

In [32]:
data = { "Names" : ["Babar Azam","Sarfraz Ahmed","Abid Ali"],
         "Average" : [48,40,42],
         "Hundreds" : [22,2,5]
       }

df_without_index = pd.DataFrame(data, columns = ['Average',"Hundreds","Names","Rank"])  #when making DataFrame, we should carefull about lengths of array, all the data must have same length.

# Manual Indexing

In [33]:
pd.DataFrame(data , index = ['1st','2nd','3rd'])

             Names  Average  Hundreds
1st     Babar Azam       48        22
2nd  Sarfraz Ahmed       40         2
3rd       Abid Ali       42         5

# Manual Columns Name

In [34]:
pd.DataFrame(data , index = ['1st','2nd','3rd'] , columns = ['Average',"Hundreds","Names"])

     Average  Hundreds          Names
1st       48        22     Babar Azam
2nd       40         2  Sarfraz Ahmed
3rd       42         5       Abid Ali

In [35]:
df = pd.DataFrame(data , index = ['1st','2nd','3rd'] , columns = ['Average',"Hundreds","Names","Rank"]) #adding one more column

In [36]:
df

     Average  Hundreds          Names Rank
1st       48        22     Babar Azam  NaN
2nd       40         2  Sarfraz Ahmed  NaN
3rd       42         5       Abid Ali  NaN

# Accesing and extracting data from DataFrame

In [37]:
df['Average']   #Dictionary like notation

1st    48
2nd    40
3rd    42
Name: Average, dtype: int64

In [38]:
df.Average  # Attribute Style Method

1st    48
2nd    40
3rd    42
Name: Average, dtype: int64

# LOC and ILOC

In [39]:
df.loc["1st"]  #loc retrieve the data by actual index name

Average             48
Hundreds            22
Names       Babar Azam
Rank               NaN
Name: 1st, dtype: object

In [40]:
df.iloc[0]  # iloc retreive data by default indexes that is starts from 0

Average             48
Hundreds            22
Names       Babar Azam
Rank               NaN
Name: 1st, dtype: object

# Fill column of nan

In [41]:
df

     Average  Hundreds          Names Rank
1st       48        22     Babar Azam  NaN
2nd       40         2  Sarfraz Ahmed  NaN
3rd       42         5       Abid Ali  NaN

In [42]:
df["Rank"] = [1,2,3]  #by list

In [43]:
df

     Average  Hundreds          Names  Rank
1st       48        22     Babar Azam     1
2nd       40         2  Sarfraz Ahmed     2
3rd       42         5       Abid Ali     3

In [44]:
import numpy as np
df["Rank"] = np.arange(3)   #by numpy range

In [45]:
df

     Average  Hundreds          Names  Rank
1st       48        22     Babar Azam     0
2nd       40         2  Sarfraz Ahmed     1
3rd       42         5       Abid Ali     2

In [46]:
df["Rank"] = range(1,4)   # by range

In [47]:
df

     Average  Hundreds          Names  Rank
1st       48        22     Babar Azam     1
2nd       40         2  Sarfraz Ahmed     2
3rd       42         5       Abid Ali     3

In [48]:
df["Rank"] = ['one','two','three']  #by string list

In [49]:
df

     Average  Hundreds          Names   Rank
1st       48        22     Babar Azam    one
2nd       40         2  Sarfraz Ahmed    two
3rd       42         5       Abid Ali  three

In [50]:
df['Rank'] = 12 #by single value

In [51]:
df

     Average  Hundreds          Names  Rank
1st       48        22     Babar Azam    12
2nd       40         2  Sarfraz Ahmed    12
3rd       42         5       Abid Ali    12

In [52]:
rank_data = pd.Series([2,4,6] , index=['2nd','3rd','1st'])

In [53]:
df["Rank"] = rank_data

In [54]:
df

     Average  Hundreds          Names  Rank
1st       48        22     Babar Azam     6
2nd       40         2  Sarfraz Ahmed     2
3rd       42         5       Abid Ali     4

In [55]:
rank_data2 = pd.Series([2,4,6])  #if we dont have manual indexes in Dataframe, so we can give data to column without mentioning indexes.

In [56]:
df_without_index['Rank'] = rank_data2

In [57]:
df_without_index

   Average  Hundreds          Names  Rank
0       48        22     Babar Azam     2
1       40         2  Sarfraz Ahmed     4
2       42         5       Abid Ali     6

# Adding two DataFrames

In [58]:
import numpy as np

In [75]:
num = np.arange(6)

data1 = { 'data' :  num}
df1 = pd.DataFrame(data1)
df1

   data
0     0
1     1
2     2
3     3
4     4
5     5

In [79]:
data2 = { 'data' : num }
df2 = pd.DataFrame(data2)
df2

   data
0     0
1     1
2     2
3     3
4     4
5     5

In [80]:
df3 = df1 + df2

In [86]:
df3             # when applying any airthmetic operation, column name and indexes should be same.
                # FOR EXAMPLE : if we have 5 indexes in df1 and 6 in df2 so the 6 of df2 does not find 6 in df1, 6 index index will
                # add to the df3 with NAN value.
                # NOTE : Column Name should be same after that Indexes should be same. 
                # if column does not same, so the column of new dataframe will have all NAN values.
                # if index does not same, so the unmatch index will add to the new dataframe with NAN value.

   data
0     0
1     2
2     4
3     6
4     8
5    10

# Function Applying

In [106]:
f = lambda x : x.max() - x.min()

data_df = [2.1,3.2,4.3,5.4,6.5]

df_func = { 'Data' : data_df }

func = pd.DataFrame(df_func)
 
func

   Data
0   2.1
1   3.2
2   4.3
3   5.4
4   6.5

In [109]:
func.apply(f) #we apply f function by mentioning axises or rows and columns  -axis=0
                                                                            # -axis=1
                                                                            # axis = 'rows' or axis = 'columns'

Data    4.4
dtype: float64

# Data Alignment

In [112]:
import numpy as np

In [145]:
df = pd.DataFrame(np.arange(25).reshape(5,5),
                  index = ['one','two','three','four','five'],
                  columns = ["Karachi","Islamabad","Peshawar","Quetta","Faisalabad"]
                 
                 
                 )   # we can specify our columns name as well in DataFrames.

In [149]:
df

       Karachi  Islamabad  Peshawar  Quetta  Faisalabad
one          0          1         2       3           4
two          5          6         7       8           9
three       10         11        12      13          14
four        15         16        17      18          19
five        20         21        22      23          24

In [150]:
df.loc['three','Peshawar']

12

In [151]:
df.loc['three',['Peshawar','Quetta']]

Peshawar    12
Quetta      13
Name: three, dtype: int32

In [152]:
df.loc[['two','three'],'Peshawar']

two       7
three    12
Name: Peshawar, dtype: int32

In [153]:
df.loc[['two','three'],['Peshawar','Quetta']]

       Peshawar  Quetta
two           7       8
three        12      13

In [155]:
df.iloc[0,2:]

Peshawar      2
Quetta        3
Faisalabad    4
Name: one, dtype: int32

In [156]:
df.iloc[0,[2,3,4]]

Peshawar      2
Quetta        3
Faisalabad    4
Name: one, dtype: int32

In [157]:
df.iloc[2:,2]

three    12
four     17
five     22
Name: Peshawar, dtype: int32

# Airthematic Methods with fill values

In [188]:
df = pd.DataFrame(np.arange(25).reshape(5,5),
                  index = ['one','two','three','four','five'],
                  columns = ["Karachi","Islamabad","Peshawar","Quetta","Faisalabad"]
                 
                 
                 )

In [202]:
df2 = pd.DataFrame(np.arange(25).reshape(5,5),
                  index = ['one','two','three','four','five'],
                  columns = ["Karachi","Islamabad","Peshawar","Quetta","Multan"]
                 
                 
                 )

In [233]:
df + df2

       Faisalabad  Islamabad  Karachi  Multan  Peshawar  Quetta
one           NaN          2        0     NaN         4       6
two           NaN         12       10     NaN        14      16
three         NaN         22       20     NaN        24      26
four          NaN         32       30     NaN        34      36
five          NaN         42       40     NaN        44      46

In [234]:
df3 = df.add(df2 , fill_value=0)

In [235]:
df3

       Faisalabad  Islamabad  Karachi  Multan  Peshawar  Quetta
one           4.0          2        0     4.0         4       6
two           9.0         12       10     9.0        14      16
three        14.0         22       20    14.0        24      26
four         19.0         32       30    19.0        34      36
five         24.0         42       40    24.0        44      46

# Deleting Data

In [236]:
df3.drop('two', axis=0 ,inplace = True)

In [237]:
df3

       Faisalabad  Islamabad  Karachi  Multan  Peshawar  Quetta
one           4.0          2        0     4.0         4       6
three        14.0         22       20    14.0        24      26
four         19.0         32       30    19.0        34      36
five         24.0         42       40    24.0        44      46

# Sort_index

In [251]:
df3_sort = df3.sort_index(axis = 1)

In [252]:
df3

       Faisalabad  Islamabad  Karachi  Multan  Peshawar  Quetta
one           4.0          2        0     4.0         4       6
three        14.0         22       20    14.0        24      26
four         19.0         32       30    19.0        34      36
five         24.0         42       40    24.0        44      46

In [253]:
df3_sort

       Faisalabad  Islamabad  Karachi  Multan  Peshawar  Quetta
one           4.0          2        0     4.0         4       6
three        14.0         22       20    14.0        24      26
four         19.0         32       30    19.0        34      36
five         24.0         42       40    24.0        44      46

In [255]:
df3.sort_index(axis = 0, ascending = False)

       Faisalabad  Islamabad  Karachi  Multan  Peshawar  Quetta
three        14.0         22       20    14.0        24      26
one           4.0          2        0     4.0         4       6
four         19.0         32       30    19.0        34      36
five         24.0         42       40    24.0        44      46

# sort_value

In [257]:
df3.sort_values(by='Faisalabad')

       Faisalabad  Islamabad  Karachi  Multan  Peshawar  Quetta
one           4.0          2        0     4.0         4       6
three        14.0         22       20    14.0        24      26
four         19.0         32       30    19.0        34      36
five         24.0         42       40    24.0        44      46

In [269]:
print(df3)

       Faisalabad  Islamabad  Karachi  Multan  Peshawar  Quetta
one           4.0          2        0     4.0         4       6
three        14.0         22       20    14.0        24      26
four         19.0         32       30    19.0        34      36
five         24.0         42       40    24.0        44      46

# .sum

In [277]:
df3.sum(axis=1) # axis 1 and columns gives row's sum

one       20.0
three    120.0
four     170.0
five     220.0
dtype: float64

In [279]:
df3.sum(axis = 'columns')

one       20.0
three    120.0
four     170.0
five     220.0
dtype: float64

In [281]:
df3.sum(axis=0)  # axis 0 and axis rows give column's sum

Faisalabad     61.0
Islamabad      98.0
Karachi        90.0
Multan         61.0
Peshawar      106.0
Quetta        114.0
dtype: float64

In [282]:
df3.sum(axis='rows')

Faisalabad     61.0
Islamabad      98.0
Karachi        90.0
Multan         61.0
Peshawar      106.0
Quetta        114.0
dtype: float64

In [286]:
df_mean = df + df2

In [287]:
df_mean

       Faisalabad  Islamabad  Karachi  Multan  Peshawar  Quetta
one           NaN          2        0     NaN         4       6
two           NaN         12       10     NaN        14      16
three         NaN         22       20     NaN        24      26
four          NaN         32       30     NaN        34      36
five          NaN         42       40     NaN        44      46

# .mean

In [293]:
df_mean.mean(axis=1, skipna = True) # skipna = True skip NaN values and then do operation

one       3.0
two      13.0
three    23.0
four     33.0
five     43.0
dtype: float64

In [295]:
df_mean.mean(axis=1, skipna = False)  # skipna = False , Do operation without leave Nan Values.

one     NaN
two     NaN
three   NaN
four    NaN
five    NaN
dtype: float64

# .unique()

In [299]:
df_mean['Karachi'].unique()

array([ 0, 10, 20, 30, 40], dtype=int64)

# value_counts

In [301]:
df_mean['Islamabad'].value_counts()

42    1
22    1
12    1
2     1
32    1
Name: Islamabad, dtype: int64

# reindex

In [302]:
obj = pd.Series(['red','green','blue'] , index = [3,5,8])

In [303]:
obj

3      red
5    green
8     blue
dtype: object

In [305]:
obj.reindex(range(9),  method='ffill')

0      NaN
1      NaN
2      NaN
3      red
4      red
5    green
6    green
7    green
8     blue
dtype: object

# read_csv

In [306]:
df = pd.read_csv("TAXRATES1.csv")

In [307]:
df

,Unnamed: 0,State,ZipCode,TaxRegionName,StateRate,EstimatedCombinedRate,EstimatedCountyRate,EstimatedCityRate,EstimatedSpecialRate,RiskLevel
0,0,AK,one,ANCHORAGE BOROUGH,0.0,0.0,0.0,NaN,0.0,1
1,1,AK,one,ANCHORAGE BOROUGH,0.0,NaN,0.0,0.0,0.0,2
2,2,AK,two,ANCHORAGE BOROUGH,0.0,0.0,NaN,0.0,NaN,3
3,3,AK,two,ANCHORAGE BOROUGH,NaN,0.0,0.0,0.0,0.0,4

In [317]:
df = pd.read_csv("TAXRATES1.csv" , names = ['a','b','c','d','f','e','g','h','i','j']) # we assign our columns name by names method in read_csv

In [318]:
df

,a,b,c,d,f,e,g,h,i,j
0,NaN,State,ZipCode,TaxRegionName,StateRate,EstimatedCombinedRate,EstimatedCountyRate,EstimatedCityRate,EstimatedSpecialRate,RiskLevel
1,0.0,AK,one,ANCHORAGE BOROUGH,0,0,0,NaN,0,1
2,1.0,AK,one,ANCHORAGE BOROUGH,0,NaN,0,0,0,2
3,2.0,AK,two,ANCHORAGE BOROUGH,0,0,NaN,0,NaN,3
4,3.0,AK,two,ANCHORAGE BOROUGH,NaN,0,0,0,0,4

In [339]:
df = pd.read_csv("TAXRATES1.csv" )

In [340]:
df

,Unnamed: 0,State,ZipCode,TaxRegionName,StateRate,EstimatedCombinedRate,EstimatedCountyRate,EstimatedCityRate,EstimatedSpecialRate,RiskLevel
0,0,AK,one,ANCHORAGE BOROUGH,0.0,0.0,0.0,NaN,0.0,1
1,1,AK,one,ANCHORAGE BOROUGH,0.0,NaN,0.0,0.0,0.0,2
2,2,AK,two,ANCHORAGE BOROUGH,0.0,0.0,NaN,0.0,NaN,3
3,3,AK,two,ANCHORAGE BOROUGH,NaN,0.0,0.0,0.0,0.0,4

In [341]:
#index_col

In [342]:
#na_values

In [347]:
sentinels = {'StateRate' : {'NaN' : 'NA'}}
df = pd.read_csv("TAXRATES1.csv", na_values=sentinels)

In [348]:
df

,Unnamed: 0,State,ZipCode,TaxRegionName,StateRate,EstimatedCombinedRate,EstimatedCountyRate,EstimatedCityRate,EstimatedSpecialRate,RiskLevel
0,0,AK,one,ANCHORAGE BOROUGH,0.0,0.0,0.0,NaN,0.0,1
1,1,AK,one,ANCHORAGE BOROUGH,0.0,NaN,0.0,0.0,0.0,2
2,2,AK,two,ANCHORAGE BOROUGH,0.0,0.0,NaN,0.0,NaN,3
3,3,AK,two,ANCHORAGE BOROUGH,NaN,0.0,0.0,0.0,0.0,4

In [349]:
# nrows = 100

In [350]:
# to_csv

In [351]:
# read_json

In [352]:
# to_datetime

In [1]:
# .dropna() remove whole row which have only one null value.
# .dropna(how='all')  remove row when all the values are null.

In [3]:
# .fillna(1.5)  replace all na value with 1.5.
# .fillna({column : fillwith, column : fillwith})
# .fillna(method = 'ffill', axis = 1)

In [4]:
# .duplicated()  
# .drop_duplicates()  drop the duplicates value
# .map
# .replace(value_to_replace,value_with_replace)

In [5]:
# .rename(index=str.title, columns=str.upper)
# .rename(index={'OHIO': 'INDIANA'}, inplace=True)
# .take

In [1]:
import pandas as pd

data = { "Names" : ["Babar Azam","Sarfraz Ahmed","Abid Ali"],
         "Average" : [48,40,42],
         "Hundreds" : [22,2,5]
       }

df_without_index = pd.DataFrame(data, columns = ['Average',"Hundreds","Names","Rank"])  #when making DataFrame, we should carefull about lengths of array, all the data must have same length.

In [4]:
df_without_index

   Average  Hundreds          Names Rank
0       48        22     Babar Azam  NaN
1       40         2  Sarfraz Ahmed  NaN
2       42         5       Abid Ali  NaN